## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 8 to add, 2 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                              NAME                               |
|----------|-----------------------------------------------------------------|
| delete   | `aws_ssm_parameter.weblate_google_client_id`                    |
|          | `aws_ssm_parameter.weblate_google_client_secret`                |
| update   | `module.localisation_services.aws_ecs_service.this`             |
|          | `module.localisation_services.aws_iam_policy.this_task_exec`    |
| recreate | `module.localisation_services.aws_ecs_task_definition.this`     |
| add      | `aws_efs_access_point.weblate_data`                             |
|          | `aws_efs_backup_policy.weblate_data`                            |
|          | `aws_efs_file_system.weblate_data`                              |
|          | `aws_efs_file_system_policy.weblate_data`                       |
|          | `aws_efs_mount_target.weblate_data[&quot;subnet-03ef974782a885a9f&quot;]` |
|          | `aws_efs_mount_target.weblate_data[&quot;subnet-05ec193725a0c9e5e&quot;]` |
|          | `aws_efs_mount_target.weblate_data[&quot;subnet-06cacbbeb98a04d71&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.weblate_data will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "weblate_data" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "elasticfilesystem:ClientMount",
              + "elasticfilesystem:ClientWrite",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowAccessThroughAccessPoint"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "elasticfilesystem:AccessPointArn"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]
          + sid       = "DenyNonSecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_efs_access_point.weblate_data will be created
  + resource "aws_efs_access_point" "weblate_data" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags            = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all        = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }

      + posix_user {
          + gid = 1000
          + uid = 1000
        }

      + root_directory {
          + path = "/app/data"

          + creation_info {
              + owner_gid   = 1000
              + owner_uid   = 1000
              + permissions = "750"
            }
        }
    }

  # aws_efs_backup_policy.weblate_data will be created
  + resource "aws_efs_backup_policy" "weblate_data" {
      + file_system_id = (known after apply)
      + id             = (known after apply)

      + backup_policy {
          + status = "ENABLED"
        }
    }

  # aws_efs_file_system.weblate_data will be created
  + resource "aws_efs_file_system" "weblate_data" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = (known after apply)
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all                = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + throughput_mode         = "bursting"
    }

  # aws_efs_file_system_policy.weblate_data will be created
  + resource "aws_efs_file_system_policy" "weblate_data" {
      + bypass_policy_lockout_safety_check = false
      + file_system_id                     = (known after apply)
      + id                                 = (known after apply)
      + policy                             = (known after apply)
    }

  # aws_efs_mount_target.weblate_data["subnet-03ef974782a885a9f"] will be created
  + resource "aws_efs_mount_target" "weblate_data" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "",
        ]
      + subnet_id              = "subnet-03ef974782a885a9f"
    }

  # aws_efs_mount_target.weblate_data["subnet-05ec193725a0c9e5e"] will be created
  + resource "aws_efs_mount_target" "weblate_data" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "",
        ]
      + subnet_id              = "subnet-05ec193725a0c9e5e"
    }

  # aws_efs_mount_target.weblate_data["subnet-06cacbbeb98a04d71"] will be created
  + resource "aws_efs_mount_target" "weblate_data" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "",
        ]
      + subnet_id              = "subnet-06cacbbeb98a04d71"
    }

  # aws_ssm_parameter.weblate_google_client_id will be destroyed
  # (because aws_ssm_parameter.weblate_google_client_id is not in configuration)
  - resource "aws_ssm_parameter" "weblate_google_client_id" {
      - arn       = "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-google-client-id" -> null
      - data_type = "text" -> null
      - id        = "weblate-google-client-id" -> null
      - key_id    = "alias/aws/ssm" -> null
      - name      = "weblate-google-client-id" -> null
      - tags      = {
          - "CostCentre"  = "platform-core-services"
          - "Environment" = "staging"
          - "Product"     = "localisation-services"
          - "Terraform"   = "true"
        } -> null
      - tags_all  = {
          - "CostCentre"  = "platform-core-services"
          - "Environment" = "staging"
          - "Product"     = "localisation-services"
          - "Terraform"   = "true"
        } -> null
      - tier      = "Standard" -> null
      - type      = "SecureString" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # aws_ssm_parameter.weblate_google_client_secret will be destroyed
  # (because aws_ssm_parameter.weblate_google_client_secret is not in configuration)
  - resource "aws_ssm_parameter" "weblate_google_client_secret" {
      - arn       = "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-google-client-secret" -> null
      - data_type = "text" -> null
      - id        = "weblate-google-client-secret" -> null
      - key_id    = "alias/aws/ssm" -> null
      - name      = "weblate-google-client-secret" -> null
      - tags      = {
          - "CostCentre"  = "platform-core-services"
          - "Environment" = "staging"
          - "Product"     = "localisation-services"
          - "Terraform"   = "true"
        } -> null
      - tags_all  = {
          - "CostCentre"  = "platform-core-services"
          - "Environment" = "staging"
          - "Product"     = "localisation-services"
          - "Terraform"   = "true"
        } -> null
      - tier      = "Standard" -> null
      - type      = "SecureString" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.localisation_services.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:817721384391:service/localisation-services/weblate"
        name                               = "weblate"
        tags                               = {
            "CostCentre" = "platform-core-services"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:817721384391:task-definition/weblate:23" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.localisation_services.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:817721384391:task-definition/weblate:23" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:817721384391:task-definition/weblate" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  ~ environment            = [
                        # (13 unchanged elements hidden)
                        {
                            name  = "WEBLATE_LOGLEVEL"
                            value = "INFO"
                        },
                      ~ {
                          ~ name  = "WEBLATE_REGISTRATION_ALLOW_BACKENDS" -> "WEBLATE_REGISTRATION_OPEN"
                          ~ value = "google-oauth2" -> "0"
                        },
                      - {
                          - name  = "WEBLATE_REGISTRATION_OPEN"
                          - value = "1"
                        },
                        {
                            name  = "WEBLATE_SERVER_EMAIL"
                            value = "platform@cds-snc.ca"
                        },
                        # (1 unchanged element hidden)
                        {
                            name  = "WEBLATE_SITE_TITLE"
                            value = "Weblate"
                        },
                      - {
                          - name  = "WEBLATE_SOCIAL_AUTH_GOOGLE_OAUTH2_WHITELISTED_DOMAINS"
                          - value = "cds-snc.ca"
                        },
                    ]
                  - essential              = true
                  - mountPoints            = []
                    name                   = "weblate"
                  ~ secrets                = [
                        # (4 unchanged elements hidden)
                        {
                            name      = "REDIS_PASSWORD"
                            valueFrom = "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-redis-auth_token"
                        },
                      - {
                          - name      = "WEBLATE_SOCIAL_AUTH_GOOGLE_OAUTH2_KEY"
                          - valueFrom = "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-google-client-id"
                        },
                      - {
                          - name      = "WEBLATE_SOCIAL_AUTH_GOOGLE_OAUTH2_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-google-client-secret"
                        },
                        {
                            name      = "WEBLATE_ADMIN_EMAIL"
                            valueFrom = "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-admin-email"
                        },
                        # (1 unchanged element hidden)
                    ]
                  - volumesFrom            = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ cpu                      = "1024" -> "2048" # forces replacement
      ~ id                       = "weblate" -> (known after apply)
      ~ revision                 = 23 -> (known after apply)
        tags                     = {
            "CostCentre" = "platform-core-services"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.localisation_services.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id        = "arn:aws:iam::817721384391:policy/weblate_ecs_task_exec_policy"
        name      = "weblate_ecs_task_exec_policy"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action   = [
                            "logs:PutLogEvents",
                            "logs:DescribeLogStreams",
                            "logs:CreateLogStream",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:logs:ca-central-1:817721384391:log-group:/aws/ecs/localisation-services:*"
                    },
                  ~ {
                      ~ Resource = [
                            # (1 unchanged element hidden)
                            "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-redis-auth_token",
                          - "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-google-client-secret",
                          - "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-google-client-id",
                            "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-database-username",
                            # (4 unchanged elements hidden)
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {
            "CostCentre" = "platform-core-services"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 8 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
